cmsis-svd/cmsis-svd/data/SiliconLabs/EZR32WG330F64R61.svd
        <register>
          <name>PERCTRL</name>
          <description>Peripheral Control Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0CF47FFF</resetMask>
          <fields>
            <field>
              <name>DACCH0DATA</name>
              <description>DAC CH0 data selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCH1DATA</name>
              <description>DAC CH1 data selection.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACCH0CONV</name>
              <description>DAC channel 0 conversion mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LESENSE does not control DAC CH0.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>DAC channel 0 is driven in continuous mode.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLEHOLD</name>
                  <description>DAC channel 0 is driven in sample hold mode.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLEOFF</name>
                  <description>DAC channel 0 is driven in sample off mode.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACCH1CONV</name>
              <description>DAC channel 1 conversion mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LESENSE does not control DAC CH1.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>DAC channel 1 is driven in continuous mode.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLEHOLD</name>
                  <description>DAC channel 1 is driven in sample hold mode.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLEOFF</name>
                  <description>DAC channel 1 is driven in sample off mode.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACCH0OUT</name>
              <description>DAC channel 0 output mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DAC CH0 output to pin and ACMP/ADC disabled</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN</name>
                  <description>DAC CH0 output to pin enabled, output to ADC and ACMP disabled</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCACMP</name>
                  <description>DAC CH0 output to pin disabled, output to ADC and ACMP enabled</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINADCACMP</name>
                  <description>DAC CH0 output to pin, ADC, and ACMP enabled.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACCH1OUT</name>
              <description>DAC channel 1 output mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DAC CH1 output to pin and ACMP/ADC disabled</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN</name>
                  <description>DAC CH1 output to pin enabled, output to ADC and ACMP disabled</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCACMP</name>
                  <description>DAC CH1 output to pin disabled, output to ADC and ACMP enabled</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINADCACMP</name>
                  <description>DAC CH1 output to pin, ADC, and ACMP enabled.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DACPRESC</name>
              <description>DAC prescaler configuration.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACREF</name>
              <description>DAC bandgap reference used</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP0MODE</name>
              <description>ACMP0 mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LESENSE does not control ACMP0</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX</name>
                  <description>LESENSE controls the input mux (POSSEL) of ACMP0</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUXTHRES</name>
                  <description>LESENSE controls the input mux (POSSEL) and the threshold value (VDDLEVEL) of ACMP0</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP1MODE</name>
              <description>ACMP1 mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>LESENSE does not control ACMP1</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX</name>
                  <description>LESENSE controls the input mux (POSSEL) of ACMP1</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUXTHRES</name>
                  <description>LESENSE controls the input mux and the threshold value (VDDLEVEL) of ACMP1</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WARMUPMODE</name>
              <description>ACMP and DAC duty cycle mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The analog comparators and DAC are shut down when LESENSE is idle</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEEPACMPWARM</name>
                  <description>The analog comparators are kept powered up when LESENSE is idle</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEEPDACWARM</name>
                  <description>The DAC is kept powered up when LESENSE is idle</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEEPACMPDACWARM</name>
                  <description>The analog comparators and DAC are kept powered up when LESENSE is idle</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
